Revit 2016 API
IDuctFittingAndAccessoryPressureDropUIServer Interface
 Interface for external servers providing optional UI for duct fitting and duct accessory coefficient calculation.
Namespace: Autodesk.Revit.UI.Mechanical
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public interface IDuctFittingAndAccessoryPressureDropUIServer : IExternalServer
Visual Basic
Public Interface IDuctFittingAndAccessoryPressureDropUIServer _
	Inherits IExternalServer
Visual C++
public interface class IDuctFittingAndAccessoryPressureDropUIServer : IExternalServer
See Also
IDuctFittingAndAccessoryPressureDropUIServer Members
Autodesk.Revit.UI.Mechanical Namespace